app/Controllers/Admin.php

SELECT *
FROM `posts`
---
     public function posts(){
         if($this->checkUser()===false){
                return redirect()->to('/login');
        };


        $data = [
             "active_page"=>"posts"
        ];

          $table = new \CodeIgniter\View\Table();
            $builder = $this->db->table('posts');
            $query = $builder->get();

SELECT `id`, `name`
FROM `customers`
---
    public function getCustomers(){

            $data = [];
            $builder = $this->db->table('customers');
                $builder->select('id,name');
                $query   = $builder->get();