app/Controllers/Home.php

SELECT *
FROM `products`
SELECT *
FROM `products`
WHERE `id` = '6'
---
    public function showProducts($id = ""){
            $data = [];
            $builder = $this->db->table('products');

            if($id==""){
                $query   = $builder->get();
            }else{
                $query   = $builder->where('id',$id)->get();

INSERT INTO `products` (`nosaukums`, `apraksts`, `cena`, `attels`) VALUES ('jauns produkts 234', 'sadfasd asdf asdf ', '345', 'jauns url')
---
    public function addProduct(){


            $builder = $this->db->table('products');
            //$data = $this->request->getPost();
            $data = [
                "nosaukums"=>esc($this->request->getPost('nosaukums')),
                "apraksts"=>esc($this->request->getPost('apraksts')),
                "cena"=>esc($this->request->getPost('cena')),
                "attels"=>esc($this->request->getPost('attels'))
            ];
            if($builder->insert($data)){