app/Controllers/Shop.php

SELECT *
FROM `digital_products`
---
    public function index(){

          $builder = $this->db->table('digital_products');
            $data["products"] = [];
               $query   = $builder->get();